import {useTranslations} from 'next-intl';

// const  t = useTranslations('landingPage.control');


// data for Control section
export const ControlData = [
    { header: "إدارة الدورات بكفاءة", desc: "يمكن للمعلمين إنشاء وإدارة دورات تعليمية مخصصة بسهولة، مما يسهل على الطلاب متابعة موادهم التعليمية." },
    { header: "تقارير وتحليلات متقدمة", desc: "يوفر أكاديميا تقارير وتحليلات مفصلة تساعد المعلمين والإداريين على اتخاذ قرارات مستنيرة بناءً على بيانات دقيقة." },
    { header: "تقويم متكامل", desc: "يوفر التطبيق تقويمًا متكاملًا يساعد الطلاب والمعلمين على تتبع المواعيد الهامة والأنشطة الدراسية." },
    { header: "نظام تقييم شامل", desc: "يحتوي أكاديميا على نظام تقييم شامل يساعد المعلمين على تقييم أداء الطلاب بفعالية ودقة." },
];

// data for Education section
export const EducationData = [
    { header: "دعم التعلم الذاتي", desc: "توفر أكاديميا ميزات تساعد الطلاب على التعلم بشكل ذاتي، مثل الاختبارات الذاتية والتقييمات الفورية." },
    { header: "إشعارات فورية", desc: "يحصل المستخدمون على إشعارات فورية حول التحديثات الهامة مثل مواعيد الاختبارات ، مما يضمن البقاء على اطلاع دائم." },
    { header: "دعم التعلم المتنقل", desc: "التطبيق متاح على جميع الأجهزة المحمولة، مما يتيح للطلاب التعلم من أي مكان وفي أي وقت." },
    { header: "أدوات التفاعل الحية", desc: "يحتوي أكاديميا على أدوات تفاعل حية مثل التعليقات والاختبارات الفورية، مما يجعل التعليم أكثر ديناميكية وتفاعلاً." },
];